// Розробник програми Косих Анатолій К-13

bool domain_162(double);
// перевіряє, чи належить введене число області визначення виразу log_5 (7*х) + П/18
// якщо "х" більший за нуль функція повертає ознаку успішності "true", в іншому випадку - "fasle"

bool f_162(double, double&);
// обчислює вираз за допомогою першого аргументу і повертає обчислене значення через другий аргумент

double f_exc_162(double);
// виконує обчислення виразу і повертає обчислене значення, якщо обчислення можливе
// в іншому випадку кидає виняток типу domain_error